Repository: TheRedSpy15/blazedcloud
Catalog: lib/l10n/intl_*.arb
Languages: hi

# serverMaintenance
source: Server is currently undergoing maintenance. Please try again later.
hi: सर्वर वर्तमान में मेनटेनेंस के तहत है। कृपया बाद में पुनः प्रयास करें।

# appName
source: Blazed Cloud
hi: ब्लेज्ड क्लाउड

source: Save
hi: सहेजें

source: Delete
hi: हटाएं

# emptyDirectory
source: No files or folders
hi: कोई फ़ाइल या फ़ोल्डर नहीं

source: Error: {err}
hi: त्रुटि: {err}

source: Invalid email or password
hi: अमान्य ईमेल या पासवर्ड

source: Login
hi: लॉगिन

source: Forgot password?
hi: पासवर्ड भूल गए?

source: Reset password
hi: पासवर्ड रीसेट

source: Email
hi: ईमेल

source: Cancel
hi: रद्द करें

source: Password reset email sent!
hi: पासवर्ड रीसेट ईमेल भेजा गया है!

source: Error sending password reset email
hi: पासवर्ड रीसेट ईमेल भेजने में त्रुटि

source: Send
hi: भेजें

source: Password
hi: पासवर्ड

source: Settings
hi: सेटिंग्स

source: Transfers
hi: ट्रांसफर्स

source: Files
hi: फ़ाइलें

source: Email Domain not allowed
hi: ईमेल डोमेन अनुमत नहीं है

# passwordMustBePasswordminlengthCharactersLong
source: Password must be {length} characters long
hi: पासवर्ड {length} अक्षरों का होना चाहिए

source: Sign up
hi: साइन अप करें

source: Failed loging in after signup
hi: साइन अप के बाद लॉगिन में असफल

source: Error sending request
hi: अनुरोध भेजने में त्रुटि

source: Request Sent!
hi: अनुरोध भेजा गया!

source: Error updating user. Please try again.
hi: उपयोगकर्ता को अपडेट करने में त्रुटि. कृपया पुनः प्रयास करें।

source: Delete file
hi: फ़ाइल हटाएं

source: Are you sure you want to delete this file?
hi: क्या आप इस फ़ाइल को हटाना चाहते हैं?

# downloadingGetfilenamefilekey
source: Downloading {filename}
hi: {filename} डाउनलोड हो रहा है

# openingFileGetfilenamefilekey
source: Opening file: {filename}
hi: फ़ाइल खोल रहा है: {filename}

# errorOpeningFileE
source: Error opening file: {filename}
hi: त्रुटि फ़ाइल खोलते समय: {filename}

source: Opening in browser...
hi: ब्राउज़र में खोला जा रहा है...

source: Failed to open. Please try saving the file first
hi: खोलने में असफल हुआ। कृपया पहले फ़ाइल को सहेजने का प्रयास करें

# fileGetfilenamefilekeyIsNotAvailableOffline
source: File {filename} is not available offline
hi: फ़ाइल {filename} ऑफ़लाइन उपलब्ध नहीं है

source: Share file
hi: फ़ाइल साझा करें

source: Link copied to clipboard
hi: लिंक क्लिपबोर्ड पर कॉपी किया गया है

source: Share
hi: साझा करें

source: Open
hi: खोलें

source: Blazed Explorer
hi: ब्लेज्ड एक्सप्लोरर

source: Create folder
hi: फ़ोल्डर बनाएं

source: Create
hi: बनाएं

source: Delete folder
hi: फ़ोल्डर हटाएं

# confirmFolderDelete
source: Are you sure you want to delete this Folder? {foldername}
hi: क्या आप इस फ़ोल्डर को हटाना चाहते हैं? {foldername}

source: Authentication Required
hi: प्रमाणीकरण आवश्यक है

# areYouSureYouWantToDeleteYourAccountThis
source: Are you sure you want to delete your account? This is irreversible. Please note, you will need to cancel your subscription through the play store manually (if you have one)
hi: क्या आप वाकई अपने खाता को हटाना चाहते हैं? यह अनपुनरावृत्ती है। कृपया ध्यान दें, आपको अगर है तो आपको अपनी सदस्यता को प्ले स्टोर से मैन्युअली रद्द करना होगा।

source: Delete account
hi: खाता हटाएं

source: Account deleted
hi: खाता हटा दिया गया है

source: Your account has been deleted.
hi: आपका खाता हटा दिया गया है।

source: OK
hi: ठीक है

source: Failed to delete account
hi: खाता हटाने में असफल

source: Change Download Location
hi: डाउनलोड स्थान बदलें

source: Change Email
hi: ईमेल बदलें

# willSendALinkToYourEmailToCompleteThe
source: Will send a link to your email to complete the change
hi: आपके ईमेल पर एक लिंक भेजा जाएगा ताकि आप परिवर्तन को पूरा कर सकें

source: View backend on Github
hi: जितह पर देखें

source: View on Github
hi: जितह पर देखें

source: Auto Delete Acount
hi: स्वतः हटाएं खाता

# deleteYourAccountAfter90DaysOfInactivityUsersWith
source: Delete your account after 90 days of inactivity. Always ignored for users with active subscriptions.
hi: निष्क्रियता के बाद 90 दिनों में अपने खाता को हटाएं। हमेशा ऐक्टिव सब्सक्रिप्शन वाले उपयोगकर्ताओं के लिए हमेशा अनदेखा किया जाता है।

source: Sign Out
hi: साइन आउट

source: Are you sure you want to sign out?
hi: क्या आप सचमुच साइन आउट करना चाहते हैं?

source: Require biometrics to open app
hi: ऐप खोलने के लिए बायोमेट्रिक्स की आवश्यकता है

source: Change Password
hi: पासवर्ड बदलें

# willSendALinkToYourEmailToResetYour
source: Will send a link to your email to reset your password
hi: आपके ईमेल पर एक लिंक भेजा जाएगा ताकि आप अपना पासवर्ड रीसेट कर सकें

source: Downloading...
hi: डाउनलोड हो रहा है...

source: Downloaded
hi: डाउनलोड हो गया

source: Select download directory
hi: डाउनलोड निर्दिष्ट करें डायरेक्टरी

# pleaseSelectADirectoryWhereYouWouldLikeToDownload
source: Please select a directory where you would like to download your files in the next screen.
hi: कृपया चुनें एक डायरेक्टरी जहां आप अगले स्क्रीन में अपनी फ़ाइलें डाउनलोड करना चाहेंगे।

source: Pick Folder
hi: फ़ोल्डर चुनें

# offlineFilesAreStoredAtSnapshotdata
source: Offline files are stored at {path}
hi: ऑफ़लाइन फ़ाइलें {path} पर संग्रहित हैं

source: Uploading...
hi: अपलोड हो रहा है...

source: Uploaded
hi: अपलोड हो गया

# purchase1tbUsingPlaystoreBuildYouCanUninstallThatVersion
source: Purchase 1TB using Playstore build. You can uninstall that version when done.
hi: प्ले स्टोर बिल्ड का उपयोग करके 1TB खरीदें। आप उस संस्करण को स्थानांतरित कर सकते हैं जब काम हो जाए।

source: Folder name
hi: फ़ोल्डर का नाम

source: Storage Usage
hi: स्टोरेज उपयोग

# howLongToShare
source: How long should the file be available for sharing?
hi: फ़ाइल को साझा करने के लिए कितनी देर तक उपलब्ध रखा जाना चाहिए?

source: Upgrade Storage (1 Terabyte)
hi: स्टोरेज अपग्रेड (1 टेराबाइट)
